In [24]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [25]:
dframe1 = DataFrame(np.arange(8).reshape(2,4),index=pd.Index(['LA','SF'],name='city'),
                   columns=pd.Index(['A','B','C','D'],name='letter'))

In [26]:
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [27]:
dframe_stack = dframe1.stack() #rows to columns, columns to row, index by city
dframe_stack

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [28]:
dframe_stack.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [29]:
dframe_stack.unstack('letter') #same above, 'letter by default'

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [30]:
dframe_stack.unstack('city') 
#index city became the columns, 
#letter columns became rows

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [31]:
ser1 = Series([0,1,2],index=['Q','X','Y'])
ser2 = Series([4,5,6],index=['X','Y','Z'])
#two Series to DataFrame by concat
dframe = pd.concat([ser1,ser2],keys=['Alpha','Beta'])

In [32]:
dframe #Not DataFrame yet

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [33]:
#Series to Dataframe by unstacking
dframe.unstack() 
#index becomes columns, key became rows
#Null values

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [34]:
dframe.unstack().stack() #Filtering out the Null Values

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [39]:
dframe = dframe.unstack() #Looking into the missing steps????
dframe

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [40]:
dframe.stack(dropna=False)

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    4.0
       Y    5.0
       Z    6.0
dtype: float64